Section_4_Real_Workload_Validation/Experiment13/data/raw/case-A/sustained-ramp/trial_010/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 20.082ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 20.383ms, rate sampling interval: 48ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.94ms    8.97ms 179.84ms   92.21%
    Req/Sec   100.81     89.22   454.00     44.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.90ms
 75.000%   19.76ms
 90.000%   25.79ms
 99.000%   51.07ms
 99.900%  151.81ms
 99.990%  171.90ms
 99.999%  179.97ms
100.000%  179.97ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.151     0.000000            1         1.00
      13.471     0.100000         3396         1.11
      14.447     0.200000         6791         1.25
      15.287     0.300000        10205         1.43
      16.071     0.400000        13603         1.67
      16.895     0.500000        16993         2.00
      17.327     0.550000        18679         2.22
      17.823     0.600000        20410         2.50
      18.335     0.650000        22083         2.86
      18.959     0.700000        23778         3.33
      19.759     0.750000        25490         4.00
      20.271     0.775000        26333         4.44
      20.895     0.800000        27173         5.00
      21.695     0.825000        28024         5.71
      22.751     0.850000        28866         6.67
      24.111     0.875000        29714         8.00
      24.879     0.887500        30139         8.89
      25.791     0.900000        30565        10.00
      26.863     0.912500        30985        11.43
      28.303     0.925000        31409        13.33
      29.791     0.937500        31835        16.00
      30.639     0.943750        32046        17.78
      31.759     0.950000        32258        20.00
      33.119     0.956250        32473        22.86
      34.399     0.962500        32684        26.67
      36.415     0.968750        32899        32.00
      37.631     0.971875        33003        35.56
      38.719     0.975000        33108        40.00
      40.351     0.978125        33213        45.71
      42.303     0.981250        33322        53.33
      44.543     0.984375        33425        64.00
      46.175     0.985938        33478        71.11
      47.615     0.987500        33533        80.00
      49.855     0.989062        33585        91.43
      51.711     0.990625        33637       106.67
      53.951     0.992188        33691       128.00
      55.807     0.992969        33717       142.22
      57.023     0.993750        33744       160.00
      59.103     0.994531        33771       182.86
      60.607     0.995313        33796       213.33
      64.159     0.996094        33823       256.00
      65.983     0.996484        33836       284.44
      70.655     0.996875        33849       320.00
      79.039     0.997266        33863       365.71
      86.783     0.997656        33876       426.67
      99.327     0.998047        33889       512.00
     118.783     0.998242        33896       568.89
     129.343     0.998437        33902       640.00
     140.543     0.998633        33909       731.43
     146.943     0.998828        33916       853.33
     152.191     0.999023        33923      1024.00
     156.415     0.999121        33926      1137.78
     157.055     0.999219        33929      1280.00
     158.847     0.999316        33932      1462.86
     160.639     0.999414        33936      1706.67
     161.791     0.999512        33940      2048.00
     162.431     0.999561        33941      2275.56
     163.583     0.999609        33942      2560.00
     165.119     0.999658        33945      2925.71
     165.631     0.999707        33946      3413.33
     166.143     0.999756        33947      4096.00
     167.679     0.999780        33948      4551.11
     169.471     0.999805        33949      5120.00
     170.751     0.999829        33950      5851.43
     171.007     0.999854        33951      6826.67
     171.007     0.999878        33951      8192.00
     171.903     0.999890        33952      9102.22
     171.903     0.999902        33952     10240.00
     174.719     0.999915        33953     11702.86
     174.719     0.999927        33953     13653.33
     174.719     0.999939        33953     16384.00
     175.743     0.999945        33954     18204.44
     175.743     0.999951        33954     20480.00
     175.743     0.999957        33954     23405.71
     175.743     0.999963        33954     27306.67
     175.743     0.999969        33954     32768.00
     179.967     0.999973        33955     36408.89
     179.967     1.000000        33955          inf
#[Mean    =       18.938, StdDeviation   =        8.971]
#[Max     =      179.840, Total count    =        33955]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  36002 requests in 3.00m, 29.29MB read
Requests/sec:    199.99
Transfer/sec:    166.59KB